In [1]:
import sqlite3

In [2]:
# connect to an SQLite database
con = sqlite3.connect('example.db')
con

In [3]:
cur = con.cursor()

In [4]:
# create a table
cur.execute('''
  CREATE TABLE IF NOT EXISTS employees(
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                name TEXT NOT NULL,
                age INTEGER,
                department TEXT
                )
''')

# commit the changes
con.commit()

In [7]:
# Insert the data in sqlite table
cur.execute('''
  INSERT INTO employees(name,age,department)
  VALUES ('Ahmed',22,'Data Scientist')
''')

cur.execute('''
  INSERT INTO employees(name,age,department)
  VALUES ('Ali ',35,'Engineering')
''')

cur.execute('''
  INSERT INTO employees(name,age,department)
  VALUES ('Sayed',42,'Finance')
''')

# commit the changes
con.commit()

In [8]:
# Query the data from the table
cur.execute('''
  SELECT * FROM employees
''')
rows = cur.fetchall()

# print the quired data
for row in rows:
  print(row)

(1, 'Ahmed', 22, 'Data Scientist')
(2, 'Ali ', 35, 'Engineering')
(3, 'Sayed', 42, 'Finance')

In [10]:
# Update the data in the table

cur.execute('''
  UPDATE employees
  SET age = 34
  WHERE name = "Ahmed"
''')

con.commit()

In [11]:
# Query the data from the table
cur.execute('''
  SELECT * FROM employees
''')
rows = cur.fetchall()

# print the quired data
for row in rows:
  print(row)

(1, 'Ahmed', 34, 'Data Scientist')
(2, 'Ali ', 35, 'Engineering')
(3, 'Sayed', 42, 'Finance')

In [12]:
# delete the data from the table

cur.execute('''
  DELETE FROM employees
  WHERE name = 'Sayed'
''')

con.commit()

In [13]:
# Query the data from the table
cur.execute('''
  SELECT * FROM employees
''')
rows = cur.fetchall()

# print the quired data
for row in rows:
  print(row)

(1, 'Ahmed', 34, 'Data Scientist')
(2, 'Ali ', 35, 'Engineering')